import { Title } from "@/components/ui";


export default function Page() {
    const textPage = {
        title: 'Обмін та повернення',
        subtitle: 'ПУБЛІЧНИЙ ДОГОВІР (ОФЕРТА) НА ЗАМОВЛЕННЯ, КУПІВЛЮ-ПРОДАЖ І ДОСТАВКУ ТОВАРІВ ЗАГАЛЬНІ ПОЛОЖЕННЯ ',
        p1: 'Предмет договору:',
        li1: [
            'Продавець  зобов’язується передати у власність Покупця Товар, а Покупець  зобов’язується оплатити і прийняти Товар на умовах цього Договору',
            'Без подальшого підписання Сторонами письмових примірників Договору, він вважається укладеним з моменту, визначеного п. 3.2. Договору.',
            'Кожна Сторона гарантує іншій Стороні, що володіє необхідною дієздатністю, а  також всіма правами і повноваженнями, необхідними і достатніми для  укладання та виконання цього Договору відповідно до його умов.',
            `Всі умови Договору викладені в цій оферті є обов'язковими для Сторін. Перед придбанням Товару Покупець зобов'язаний ознайомитися з умовами цього  Договору та іншою інформацією, опублікованою на Сайті Продавця.`,
            'Особа не згодна з умовами Договору не може бути його Стороною та має  утриматися від Замовлення та придбання Товару. Особа, яка здійснила  акцепт Договору, підтверджує своє ознайомлення і згоду з усіма умовами  цього Договору та вважається Покупцем згідно з його умовами. '
        ],
        p2: 'Порядок укладання договору:',
        li2: [
            'Договір вважається укладеним і вступає в силу з моменту сукупного або окремого  виконання Покупцем будь-якої з дій передбачених п. 3.2. Договору, що  означає повне і беззастережне прийняття ним всіх умов Договору без  будь-яких виключень та/або обмежень.',
            'Покупець  Товару здійснює акцепт Договору після ознайомлення з його умовами,  викладеними на Сайті, або наданого в межах листування із Покупцем,  шляхом сукупного або окремого виконання будь-якої з наступних дій:  ',
            [
                'направлення Покупцем  Замовлення Продавцеві за допомогою засобів телефонного, електронного  зв’язку, що розміщені на Сайті Продавця, оформлення Замовлення через  Сайт Продавця чи безпосередньо звернувшись до Продавця іншими способами;',
                'поставив(ла) галочку поруч із тезою: «Я прочитав(ла) і погоджуюсь з умовами Публічної оферти»; ',
                'Повна  оплата чи часткова передплата Покупцем Товару, або іншою уповноваженою  ним особою, згідно з встановленим цим Договором порядком.'
            ]
        ],
        p3: 'Будь-яка  із зазначених у п. 3.2 дій окремо, якщо вона виконана Покупцем Товару,  свідчить про те, що Покупець ознайомлений з цим Договором і згодний з  його умовами в повному обсязі.',
        p4: 'Порядок оформлення замовлення:',
        li4: [
            'Покупець  має право оформити замовлення на будь-який товар, представлений на  Сайті, шляхом заповнення відповідної форми через Сайт або за вказаними  номерами телефонів, або шляхом надсилання повідомлення засобами  електронного звʼязку (в тому числі, але не виключно через повідомлення в  соціальних мережах, месенджерах, чаті на Сайті, електронну пошту тощо) ',
            'Замовлення  вважається оформленим належним чином, якщо Покупець заповнив усі поля  форми чи надав необхідну інформацію засобами телефонного чи електронного  звʼязку, що дозволяють ідентифікувати клієнта і зв’язатися з ним, а  саме:',
            [
                'Прізвище, імʼя;',
                'Адреса доставки;',
                'Контактний телефон;',
                'Вибрати спосіб оплати;',
                'Вибрати спосіб доставки товару.'
            ],
            'При  відсутності товару на складі Продавець зобов’язаний поставити Покупця  до відома (по телефону або через електронні засоби звʼязку).',
            'Покупець  несе відповідальність за точність та / або достовірність наданої  інформації при оформленні Замовлення, недостовірні дані надані Покупцем,  можуть спричинити можливість неналежного виконання Продавцем своїх  зобов’язань перед Покупцем.',
            'Спілкування  Покупця і Продавця має бути побудовано на загальноприйнятих принципах  моралі та етикету. Строго заборонено використання нецензурних слів,  образ, а також погроз і шантажу, незалежно від того, кому вони були  адресовані.',
            'При  відсутності Товару Покупець має право замінити його Товаром аналогічної  моделі, відмовитися від цього Товару та анулювати замовлення.',
            'При  відсутності можливості зв’язатися з Покупцем за вказаним при оформленні  замовлення номеру телефону чи інших засобів звʼязку Замовлення  вважається анульованим, за виключенням випадків повної оплати Товару.'
        ],
        p5: 'Порядок оплати замовлення:',
        li5: [
            'Оплата замовлення означає згоду Покупця на укладення цього Договору з Продавцем.',
            'Покупець  оплачує повну вартість замовлення за Договором або за погодженням з  Продавцем (через інстаграм) здійснює мінімальну передплату за Товар в  розмірі 200 грн., яка є завдатком (утримується для оплати доставки у  обидві сторони) , а остаточний розрахунок здійснює через компанію  перевізника. Оплата здійснюється банківським переказом за платіжними  реквізитами Продавця чи за допомогою платіжних карток міжнародних  платіжних систем через платіжний сервіс, який інтегрований в Сайт  Продавця. При оплаті за допомогою платіжних карток міжнародних платіжних  систем через платіжний сервіс, який інтегрований в Сайт Продавця,  можлива лише оплата повної вартості замовлення.',
            'Оплатити  замовлення готівкою також можливо при отриманні замовлення у будь-якому  відділенні компанії перевізника за умови оплати завдатку перед  відправкою Товару в розмірі, визначеному у п.5.2 або іншому розмірі,  визначеному Продавцем. Комісію за пересилання коштів сплачує Покупець. В  разі відмови Покупця від отримання Товару, завдаток не підлягає  поверненню.',
            'В  разі відмови Покупця від отримання Товару, який оплачено повністю,  Продавець з суми оплати утримує кошти на  покриття витрат з  транспортування.  ',
            'Оплату вартості доставки Товару перевізником здійснює Покупець, її вартість не включена до вартості Товару. ',
            'Вартість  Товару не включає в себе будь-які комісії, що стягуються банками чи  платіжними системами за проведення платежу та/або за конвертацію валют.  Комісійні витрати за здійснення платежів за даним Договором Покупець  сплачує додатково. Також Покупець несе всі вищевказані витрати у випадку  повернення Продавцем йому оплати за Товар. ',
            'Ціна  Товару, зазначена на Сайті, може бути змінена Продавцем в  односторонньому порядку. При цьому ціна на замовлений та оплачений  Покупцем Товар зміні не підлягає.',
            'Продавець  має право надавати знижки на Товари та встановлювати програму бонусів.  Види знижок, бонусів, порядок і умови нарахування відображаються на  Сайті і можуть бути змінені Продавцем в односторонньому порядку.',
            'Моментом оплати вважається зарахування грошових коштів на рахунок Продавця.'
        ],
        p6: 'Умови доставки замовлення:',
        li6: [
            'Продавець надає Покупцеві послуги з доставки Товару одним із способів вказаних на  Сайті в терміни зазначені компанією перевізником. Доставка Товару  здійснюється перевізником «Нова пошта».',
            'Терміни доставки можуть бути змінені Продавцем в односторонньому порядку через об’єктивні, на думку Продавця, причини.',
            'Затримки по доставці Товарів можливі внаслідок настання непередбачених обставин, які сталися не з вини Продавця.',
            'Вартість доставки Товару Покупець оплачує самостійно згідно з тарифами компанії перевізника. '
        ],
        p7: 'Умови повернення та обміну, повернення коштів:',
        li7: [
            'Покупець  має право обміняти Товар належної якості на аналогічний у Продавця, чи  повернути, якщо Товар не задовольнив його за формою, кольором, розміром  або з інших причин та не може бути ним використаний за призначенням. Для  цього необхідно зв’язатися з Продавцем засобами електронного чи  телефонного звʼязку протягом 14 (чотирнадцяти) календарних днів з  моменту отримання Товару і повідомити Продавця про повернення / обміну  товару.',
            'Покупець  має право повернути Товар належної якості, якщо він не використовувався  і якщо збережено його товарний вигляд, споживчі властивості, не має  слідів використання Покупцем: подряпин, потертостей, плям і т. п., Товар  повністю укомплектований і збережена фабрична упаковка, збережені всі  ярлики і заводське маркування, а також розрахунковий документ, виданий  Покупцеві разом з проданим Товаром. ',
            'У разі, якщо Товар не відповідає вищезазначеним вимогам, Продавець має право відмовитися від обміну/повернення товару.',
            'Відповідно  до ст. 9 Закону України «Про захист прав споживачів», Покупець повинен  здійснити фактичне відправлення Товару, належної якості, не пізніше ніж  через 14 календарних днів з дати, отримання Товару.',
            'Якщо  Покупцеві був переданий Товар неналежної якості, Покупець має право  скористатися положеннями статті 8 Закону України «Про захист прав  споживачів» - вимагати заміни на Товар належної якості або вимагати  розірвання договору та повернення сплаченої за Товар грошової суми.',
            `Товар  неналежної якості (брак) – це товар, який містить недоліки. Недолік  товару - це невідповідність його вимогам нормативно-правових актів і  нормативних документів, умовам договору або вимогам, які пред'являються  до нього. Відмінність елементів дизайну або оформлення від заявленого на  Сайті опису не є ознакою неналежної якості.`,
            'Повернення/обмін Товару належної якості здійснюється за рахунок Покупця. За рахунок  Продавця здійснюється у випадку придбання Товару неналежної якості.',
            'Повернення вартості придбаного Товару здійснюється протягом 5 банківських днів з  моменту отримання Товару Продавцем. Вартість Товару підлягає поверненню  шляхом перерахування грошових коштів на банківський рахунок Покупця. Всі  операційні витрати банку за повернення грошових коштів оплачує  Покупець. Сума операційних витрат банку буде вирахувана із суми  повернення автоматично. ',
            'У разі відмови отримувачем Товару  після огляду, з отримувача буде стягнуто суму в розмірі 200 грн. (двісті  гривень) за компенсацію вартості доставки Товару в обидві сторони (від  Продавця до Покупця і в іншу сторону)'
        ],
    }


    return(
        <div className="border-l-[1px] font-mont border-[#EDEDED] text-sm w-full px-10 flex flex-col gap-5">
            <Title text={textPage.title} size="lg" className=' font-semibold uppercase ' />
            <div className="flex flex-col gap-5">
                <div className="h-10 flex items-center">
                    <Title text={textPage.subtitle} size="xs" className='font-semibold uppercase text-[#212121]' />
                </div>
                <p className="font-semibold">{textPage.p1}</p>
                <ol className="flex flex-col gap-2 list-decimal list-outside ml-5">
                    {textPage.li1.map((item, index) => (
                        <li key={index}>{item}</li>
                    ))}
                </ol>
            </div>

            <div className="flex flex-col gap-5">
                <p className="font-semibold">{textPage.p2}</p>
                <ol className="flex flex-col gap-2 list-decimal list-outside ml-5">
                    {textPage.li2.map((item, index) => (
                        Array.isArray(item) ? (
                            
                                <ol className="list-disc list-inside ml-4">
                                    {item.map((subitem, subindex) => (
                                        <li key={subindex}>{subitem}</li>
                                    ))}
                                </ol>
                           
                        ) : (
                            <li key={index}>{item}</li>
                        )))}
                </ol>
                <p>{textPage.p3}</p>

                <p className="font-semibold">{textPage.p4}</p>
                <ol className="flex flex-col gap-2 list-decimal list-outside ml-5">
                    {textPage.li4.map((item, index) => (
                        Array.isArray(item) ? (
                            
                                <ol className="list-[lower-latin] list-inside ml-4">
                                    {item.map((subitem, subindex) => (
                                        <li key={subindex}>{subitem}</li>
                                    ))}
                                </ol>
                           
                        ) : (
                            <li key={index}>{item}</li>
                        )))}
                </ol>

                <p className="font-semibold">{textPage.p5}</p>
                <ol className="flex flex-col gap-2 list-decimal list-outside ml-5">
                    {textPage.li5.map((item, index) => (
                            <li key={index}>{item}</li>
                        ))}
                </ol>

                <p className="font-semibold">{textPage.p6}</p>
                <ol className="flex flex-col gap-2 list-decimal list-outside ml-5">
                    {textPage.li6.map((item, index) => (
                            <li key={index}>{item}</li>
                        ))}
                </ol>

                <p className="font-semibold">{textPage.p7}</p>
                <ol className="flex flex-col gap-2 list-decimal list-outside ml-5">
                    {textPage.li7.map((item, index) => (
                            <li key={index}>{item}</li>
                        ))}
                </ol>
            </div>

            
        </div>
    )
}